In [11]:
import pandas as pd

# Load messy dataset
df = pd.read_csv("messy_students.csv")
df

    Name  Maths  Science  English
0  Aman    85.0     88.0     78.0
1  Rohan    NaN     90.0     85.0
2  kunal   76.0      NaN     80.0
3  Sunny   89.0     94.0      NaN
4  Rohan   92.0     90.0     85.0
5    NaN   95.0     91.0     88.0

In [7]:
# 1. Handle missing values
df["Name"] = df["Name"].fillna("Unknown")
df["Maths"] = df["Maths"].fillna(df["Maths"].mean())
df["Science"] = df["Science"].fillna(df["Science"].mean())
df["English"] = df["English"].fillna(df["English"].mean())

In [8]:
# 2. Remove duplicates
df = df.drop_duplicates()

In [9]:
# 3. Fix string formatting (strip + title case)
df["Name"] = df["Name"].str.strip().str.title()

In [10]:

# 4. Convert datatypes
df["Maths"] = df["Maths"].astype(int)
df["Science"] = df["Science"].astype(int)
df["English"] = df["English"].astype(int)

print(df)

      Name  Maths  Science  English
0     Aman     85       88       78
1    Rohan     87       90       85
2    Kunal     76       90       80
3    Sunny     89       94       83
4    Rohan     92       90       85
5  Unknown     95       91       88